dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/I2C0_1.0.xml
        </group>
    <group id="I2C0_DMA_TRIG1" name="I2C0_DMA_TRIG1" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="I2C0_DMA_TRIG1_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="I2C Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC. 15h-1Fh = Reserved" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="CRXFIFOTRG" value="0x1" description="Controller receive FIFO Trigger Level"/>
                <bitenum id="CTXFIFOTRG" value="0x2" description="Controller transmit FIFO Trigger level"/>
                <bitenum id="TRXFIFOTRG" value="0x3" description="Target receive FIFO Trigger Level"/>
                <bitenum id="TTXFIFOTRG" value="0x4" description="Target transmit FIFO Trigger level"/>
            </bitfield>
        </register>
        <register id="I2C0_DMA_TRIG1_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="CRXFIFOTRG" description="Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CTXFIFOTRG" description="Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TRXFIFOTRG" description="Target Receive FIFO Trigger" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TTXFIFOTRG" description="Target Transmit FIFO Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="I2C0_DMA_TRIG1_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="CRXFIFOTRG" description="Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CTXFIFOTRG" description="Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TRXFIFOTRG" description="Target Receive FIFO Trigger" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TTXFIFOTRG" description="Target Transmit FIFO Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="I2C0_DMA_TRIG1_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="CRXFIFOTRG" description="Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CTXFIFOTRG" description="Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TRXFIFOTRG" description="Target Receive FIFO Trigger" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TTXFIFOTRG" description="Target Transmit FIFO Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="I2C0_DMA_TRIG1_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="CRXFIFOTRG" description="Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CTXFIFOTRG" description="Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TRXFIFOTRG" description="Target Receive FIFO Trigger" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TTXFIFOTRG" description="Target Transmit FIFO Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="I2C0_DMA_TRIG1_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="CRXFIFOTRG" description="Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CTXFIFOTRG" description="Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TRXFIFOTRG" description="Target Receive FIFO Trigger" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TTXFIFOTRG" description="Target Transmit FIFO Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
